---
kind: method
id: M:Autodesk.Revit.DB.Macros.Macro.Dispose
source: html/0830c3f3-9b8c-8346-add2-0d35eb9a97e8.htm
---
# Autodesk.Revit.DB.Macros.Macro.Dispose Method

Releases all resources used by the Macro

## Syntax (C#)
```csharp
public void Dispose()
```